       01 CS2MBR2C-STRUCTURE-DATA-ITEM.
         05 DEP-DEP-ADDR                PIC S9(8) COMP.
         05 DEP-MED-ADDR                PIC S9(8) COMP.
         05 DEP-DNT-ADDR                PIC S9(8) COMP.
         05 FILLER                      PIC X(4).
         05 DEP-EMP-ID                  PIC X(13).
         05 DEP-REL-CD                  PIC X(2).
         05 DEP-SEX                     PIC X(1).
         05 DEP-DOB                     PIC S9(8) COMP.
         05 DEP-DIFF-ORIG-DT            PIC X(1).
         05 DEP-PRE-EXS                 PIC X(1).
         05 DEP-FNAME                   PIC X(10).
         05 DEP-SS-NBR                  PIC X(10).
         05 DEP-LNAME                   PIC X(20).
         05 DEP-SUB-XREF                PIC X(13).
         05 DEP-CENT-IND                PIC X(1).
         05 DEP-OI-VERIF-DT1            PIC S9(8) COMP.
         05 FILLER                      PIC X(1).
         05 DEP-OI-IND1                 PIC X(1).
         05 FILLER                      PIC X(2).
         05 DEP-OI-EFF-DT1              PIC S9(8) COMP.
         05 DEP-OI-CANC-DT1             PIC S9(8) COMP.
         05 DEP-DUAL-ID1                PIC X(13).
         05 FILLER                      PIC X(3).
         05 DEP-OI-VERIF-DT2            PIC S9(8) COMP.
         05 FILLER                      PIC X(1).
         05 DEP-OI-IND2                 PIC X(1).
         05 FILLER                      PIC X(2).
         05 DEP-OI-EFF-DT2              PIC S9(8) COMP.
         05 DEP-OI-CANC-DT2             PIC S9(8) COMP.
         05 DEP-DUAL-ID2                PIC X(13).
         05 FILLER                      PIC X(3).
         05 DEP-OI-VERIF-DT3            PIC S9(8) COMP.
         05 FILLER                      PIC X(1).
         05 DEP-OI-IND3                 PIC X(1).
         05 FILLER                      PIC X(2).
         05 DEP-OI-EFF-DT3              PIC S9(8) COMP.
         05 DEP-OI-CANC-DT3             PIC S9(8) COMP.
         05 DEP-DUAL-ID3                PIC X(13).
         05 FILLER                      PIC X(3).
         05 DEP-OI-VERIF-DT4            PIC S9(8) COMP.
         05 FILLER                      PIC X(1).
         05 DEP-OI-IND4                 PIC X(1).
         05 FILLER                      PIC X(2).
         05 DEP-OI-EFF-DT4              PIC S9(8) COMP.
         05 DEP-OI-CANC-DT4             PIC S9(8) COMP.
         05 DEP-DUAL-ID4                PIC X(13).
         05 FILLER                      PIC X(3).
         05 DEP-OI-VERIF-DT5            PIC S9(8) COMP.
         05 FILLER                      PIC X(1).
         05 DEP-OI-IND5                 PIC X(1).
         05 FILLER                      PIC X(2).
         05 DEP-OI-EFF-DT5              PIC S9(8) COMP.
         05 DEP-OI-CANC-DT5             PIC S9(8) COMP.
         05 DEP-DUAL-ID5                PIC X(13).
         05 FILLER                      PIC X(3).
         05 DEP-OI-VERIF-DT6            PIC S9(8) COMP.
         05 FILLER                      PIC X(1).
         05 DEP-OI-IND6                 PIC X(1).
         05 FILLER                      PIC X(2).
         05 DEP-OI-EFF-DT6              PIC S9(8) COMP.
         05 DEP-OI-CANC-DT6             PIC S9(8) COMP.
         05 DEP-DUAL-ID6                PIC X(13).
         05 FILLER                      PIC X(3).
         05 DEP-IND-OI-ID1              PIC X(8).
         05 DEP-IND-OI-ID-DT1           PIC S9(8) COMP.
         05 DEP-IND-OI-ID2              PIC X(8).
         05 DEP-IND-OI-ID-DT2           PIC S9(8) COMP.
         05 DEP-IND-OI-ID3              PIC X(8).
         05 DEP-IND-OI-ID-DT3           PIC S9(8) COMP.
         05 DEP-IND-OI-ID4              PIC X(8).
         05 DEP-IND-OI-ID-DT4           PIC S9(8) COMP.
         05 DEP-IND-OI-ID5              PIC X(8).
         05 DEP-IND-OI-ID-DT5           PIC S9(8) COMP.
         05 DEP-IND-OI-ID6              PIC X(8).
         05 DEP-IND-OI-ID-DT6           PIC S9(8) COMP.
         05 DEP-OCL3-NAME               PIC X(25).
         05 DEP-OCL3-ADDR               PIC X(20).
         05 DEP-OCL3-ADDR2              PIC X(15).
         05 DEP-OCL3-CITY               PIC X(15).
         05 DEP-OCL3-ZIP                PIC 9(9) COMP-3.
         05 DEP-OCL3-EFF-DT             PIC S9(8) COMP.
         05 DEP-OCL3-CANC-DT            PIC S9(8) COMP.
         05 DEP-OCL3-STATE              PIC X(2).
         05 DEP-OCL3-INS-NAME           PIC X(26).
         05 FILLER                      PIC X(4).
         05 DEP-MED-A-ELIG-DT           PIC S9(8) COMP.
         05 DEP-MED-B-ELIG-DT           PIC S9(8) COMP.
         05 DEP-DISAB-DT                PIC S9(8) COMP.
         05 DEP-DISAB-DIAG              PIC S9(4) COMP.
         05 DEP-NEXT-COV-ID             PIC X(13).
         05 DEP-NEXT-COV-IND            PIC X(1).
         05 DEP-MICRO-DT                PIC S9(8) COMP.
         05 DEP-OCL1-USER-ID            PIC X(8).
         05 DEP-OCL1-USER-ID-DT         PIC S9(8) COMP.
         05 DEP-OCL1-COMMENT-DT         PIC S9(8) COMP.
         05 DEP-OCL2-USER-ID            PIC X(8).
         05 DEP-OCL2-USER-ID-DT         PIC S9(8) COMP.
         05 DEP-ELIG-EFF-DT-MED1        PIC S9(8) COMP.
         05 DEP-ELIG-CANC-DT-MED1       PIC S9(8) COMP.
         05 DEP-ELIG-EFF-DT-DNT1        PIC S9(8) COMP.
         05 DEP-ELIG-CANC-DT-DNT1       PIC S9(8) COMP.
         05 DEP-CANC-CD-MED1            PIC X(1).
         05 DEP-CANC-CD-DNT1            PIC X(1).
         05 DEP-FEP-COV-SOURCE1         PIC X(1).
         05 FILLER                      PIC X(1).
         05 DEP-ELIG-EFF-DT-MED2        PIC S9(8) COMP.
         05 DEP-ELIG-CANC-DT-MED2       PIC S9(8) COMP.
         05 DEP-ELIG-EFF-DT-DNT2        PIC S9(8) COMP.
         05 DEP-ELIG-CANC-DT-DNT2       PIC S9(8) COMP.
         05 DEP-CANC-CD-MED2            PIC X(1).
         05 DEP-CANC-CD-DNT2            PIC X(1).
         05 DEP-FEP-COV-SOURCE2         PIC X(1).
         05 FILLER                      PIC X(1).
         05 DEP-ELIG-EFF-DT-MED3        PIC S9(8) COMP.
         05 DEP-ELIG-CANC-DT-MED3       PIC S9(8) COMP.
         05 DEP-ELIG-EFF-DT-DNT3        PIC S9(8) COMP.
         05 DEP-ELIG-CANC-DT-DNT3       PIC S9(8) COMP.
         05 DEP-CANC-CD-MED3            PIC X(1).
         05 DEP-CANC-CD-DNT3            PIC X(1).
         05 DEP-FEP-COV-SOURCE3         PIC X(1).
         05 FILLER                      PIC X(1).
         05 DEP-OCL2-COMMENT-DT         PIC S9(8) COMP.
         05 DEP-OCL1-NAME               PIC X(25).
         05 DEP-OCL1-ADDR               PIC X(20).
         05 DEP-OCL1-ADDR2              PIC X(15).
         05 DEP-OCL1-CITY               PIC X(15).
         05 DEP-OCL1-STATE              PIC X(2).
         05 DEP-OCL1-ZIP                PIC 9(9) COMP-3.
         05 DEP-OCL1-POLICY             PIC X(20).
         05 DEP-OCL1-PHONE              PIC 9(10) COMP-3.
         05 DEP-OCL1-EFF-DT             PIC S9(8) COMP.
         05 DEP-OCL1-CANC-DT            PIC S9(8) COMP.
         05 DEP-OCL1-INS-NAME           PIC X(26).
         05 DEP-OCL1-COMMENT            PIC X(45).
         05 DEP-OCL2-NAME               PIC X(25).
         05 DEP-OCL2-ADDR               PIC X(20).
         05 DEP-OCL2-ADDR2              PIC X(15).
         05 DEP-OCL2-CITY               PIC X(15).
         05 DEP-OCL2-POLICY             PIC X(20).
         05 DEP-OCL2-PHONE              PIC 9(10) COMP-3.
         05 DEP-OCL2-EFF-DT             PIC S9(8) COMP.
         05 DEP-OCL2-CANC-DT            PIC S9(8) COMP.
         05 DEP-OCL2-COMMENT            PIC X(45).
         05 DEP-OCL2-STATE              PIC X(2).
         05 DEP-OCL2-ZIP                PIC 9(9) COMP-3.
         05 DEP-OCL2-INS-NAME           PIC X(26).
         05 DEP-OCL1-EMPLOYER-NAME      PIC X(20).
         05 DEP-OCL2-EMPLOYER-NAME      PIC X(20).
         05 DEP-OCL3-EMPLOYER-NAME      PIC X(20).
         05 DEP-OCL3-POLICY             PIC X(20).
         05 FILLER                      PIC X(18).
         05 DEP-ST-ELIG-DT              PIC S9(8) COMP.
         05 DEP-DEP-NBR                 PIC S9(4) COMP.
         05 DEP-PRIOR-COV-ID            PIC X(13).
         05 DEP-PRIOR-COV-IND           PIC X(1).
         05 DEP-ALT-TRMT-IND            PIC X(1).
         05 DEP-EXCL-IND                PIC X(1).
         05 DEP-HRC-IND                 PIC X(1).
         05 DEP-HCFA-NBR                PIC X(13).
         05 DEP-OCL3-USER-ID            PIC X(8).
         05 DEP-OCL3-USER-ID-DT         PIC S9(8) COMP.
         05 DEP-OCL3-COMMENT-DT         PIC S9(8) COMP.
         05 DEP-OCL3-PHONE              PIC 9(10) COMP-3.
         05 DEP-OCL3-COMMENT            PIC X(45).
         05 DEP-OCL-LEGAL-IND           PIC X(1)
