      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      *    COPYBOOK: P1ON.DT.STAR.COPYLIB(BHS2CLA)                    *
      * FOR SEGMENT: BHS2CLA                                          *
      * IN DATABASE: PCBHSPA0                                         *
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
       01 BHS2CLA-STRUCTURE-DATA-ITEM.
         10 CLA-ADDR                    PIC X(25).
         10 CLA-ADDR4                   PIC X(25).
         10 CLA-CITY                    PIC X(16).
         10 CLA-ST                      PIC X(2).
         10 CLA-ZIP                     PIC S9(8) COMP
