 01 ST_KEY_REC.                               

          05 ST_KEY_LEN  PIC 9(4) COMP.             

          05 ST_KEY_VAL  PIC X(8).                  
                   
