01 ST_UOW_REC.                               

          05 ST_UOW_LEN  PIC 9(4) COMP.             

          05 ST_UOW_VAL  PIC X(16).                 

                      
